In [21]:
import pandas as pd
import numpy as np

In [22]:
#1. Create a Pandas DataFrame from a dictionary of lists
data = {
    'Name': ['Naman', 'Dipan', 'Karan', 'Syd', 'Aayush'],
    'Age': [23, 24, 24, 23, 20],
    'Department': ['IT', 'HR', 'Sales', 'IT', 'HR'],
    'Salary': [50000, 55000, 60000, 52000, np.nan]
}

df1 = pd.DataFrame(data)
df1

     Name  Age Department   Salary
0   Naman   23         IT  50000.0
1   Dipan   24         HR  55000.0
2   Karan   24      Sales  60000.0
3     Syd   23         IT  52000.0
4  Aayush   20         HR      NaN

In [23]:
#2. Read a CSV file into a DataFrame and display the first 5 rows
df = pd.read_csv('sample.csv')
df.head()

   Name   Age Department   Salary
0  John  28.0         IT  50000.0
1  Kate  34.0         HR  55000.0
2   Leo  29.0      Sales  60000.0
3  Anna   NaN         IT  52000.0
4  Mike  40.0         HR      NaN

In [24]:
#3. Get the number of rows and columns
df.shape

(5, 4)

In [25]:
#Display all column names and their data types
df.dtypes

Name           object
Age           float64
Department     object
Salary        float64
dtype: object

In [26]:
#5. Select a single column ('Name') and multiple columns ('Name', 'Age')
print(df['Name'])
print(df[['Name', 'Age']])

0    John
1    Kate
2     Leo
3    Anna
4    Mike
Name: Name, dtype: object
   Name   Age
0  John  28.0
1  Kate  34.0
2   Leo  29.0
3  Anna   NaN
4  Mike  40.0

In [27]:
#Select the first 3 rows using iloc
df.iloc[:3]

   Name   Age Department   Salary
0  John  28.0         IT  50000.0
1  Kate  34.0         HR  55000.0
2   Leo  29.0      Sales  60000.0

In [28]:
#7. Find missing values in a DataFrame
df1.isnull().sum()

Name          0
Age           0
Department    0
Salary        1
dtype: int64

In [29]:
#8. Replace all NaN values with "Unknown"
df1.fillna("Unknown", inplace=True)
df1

/tmp/ipykernel_62820/1512776527.py:2: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Unknown' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df1.fillna("Unknown", inplace=True)

     Name  Age Department   Salary
0   Naman   23         IT  50000.0
1   Dipan   24         HR  55000.0
2   Karan   24      Sales  60000.0
3     Syd   23         IT  52000.0
4  Aayush   20         HR  Unknown

In [30]:
#9. Sort the DataFrame by the 'Age' column in descending order
df1.sort_values(by='Age', ascending=False)

     Name  Age Department   Salary
1   Dipan   24         HR  55000.0
2   Karan   24      Sales  60000.0
0   Naman   23         IT  50000.0
3     Syd   23         IT  52000.0
4  Aayush   20         HR  Unknown

In [ ]:
#10. Group the DataFrame by 'Department' and calculate the average salary
df1.groupby('Department')['Salary'].mean()

#salary col ma unknown which is string tei vayera error aako ho natra it works

TypeError: agg function failed [how->mean,dtype->object]